Revit 2027 API
ColorSelectionDialog Class
 Allows display of the Revit Color dialog.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ColorSelectionDialog
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorSelectionDialog : IDisposable
Public Class ColorSelectionDialog
	Implements IDisposable
public ref class ColorSelectionDialog : IDisposable
type ColorSelectionDialog =
    class
        interface IDisposable
    end
The ColorSelectionDialog type exposes the following members.
Constructors
Name | Description
ColorSelectionDialog |  Default constructor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginalColor |  The original color.
SelectedColor |  The new color selected by the user.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ColorSelectionDialog
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Show |  Shows the Revit Color dialog as a modal dialog.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The class provides the option to launch the Revit Color dialog to select the color.
See Also
Reference
Autodesk.Revit.UI Namespace